Repository: yugui/example
Catalog: po/*.po
Languages: ca, fa

source: Try `%s --help' for more information.
ca: Prova `%s --help' per més informació.
fa: برای اطلاعات بیشتر «%s --help» را امتحان کنید.

source: hello, world
ca: hola, món
fa: سلام بر همه

source: +---------------+ | Hello, world! | +---------------+
ca: +---------------+ | Hola, món! | +---------------+
fa: ‏‎╔═════════════╗‎ ║ سلام بر همه! ║ ‏‎╚═════════════╝‎

source: Hello, world!
ca: Hola, món!
fa: سلام بر همه!

source: -h, --help display this help and exit -v, --version display version information and exit
ca: -h, --help ensenya aquesta ajuda i surt. -v, --version ensenya aquesta ajuda i surt.
fa: -h, --help این راهنما را نشان می‌دهد و خارج می‌شود -v, --version شماره‌ی نسخه را نشان می‌دهد و خارج می‌شود

source: Report bugs to <%s>.
ca: Reporteu bugs a <%s>.
fa: اشکال‌های برنامه را به <%s>، و اشکال‌های ترجمه را به <fwpg@sharif.edu> گزارش دهید.

source: %s: option `%s' is ambiguous
ca: %s: opció `%s' és ambigua
fa: %s: گزینه‌ی «%s» مبهم است

source: %s: option `--%s' doesn't allow an argument
ca: %s: opció `--%s' no permet un argument
fa: %s: گزینه‌ی «--%s» آرگومان نمی‌پذیرد

source: %s: option `%c%s' doesn't allow an argument
ca: %s: opció `%c%s' no permet un argument
fa: %s: گزینه‌ی «%c%s» آرگومان نمی‌پذیرد

source: %s: option `%s' requires an argument
ca: %s: opció `%s' necessita un argument
fa: %s: گزینه‌ی «%s» آرگومان لازم دارد

source: %s: unrecognized option `--%s'
ca: %s: opció desconeguda `%s'
fa: %s: گزینه‌ی «--%s» شناخته نشد

source: %s: unrecognized option `%c%s'
ca: %s: opció desconeguda `%c%s'
fa: %s: گزینه‌ی «%c%s» شناخته نشد

source: %s: illegal option -- %c
ca: %s opció no permesa -- %c
fa: %s: گزینه‌ی غیرمجاز -- %c

source: %s: invalid option -- %c
ca: %s: opció no vàlida --%c
fa: %s: گزینه‌ی نامعتبر -- %c

source: %s: option requires an argument -- %c
ca: %s opció requereix un argument --%c
fa: %s: گزینه آرگومان لازم دارد -- %c

source: %s: option `-W %s' is ambiguous
ca: %s: opció `-W %s' es ambigua
fa: %s: گزینه‌ی «-W %s» مبهم است

source: %s: option `-W %s' doesn't allow an argument
ca: %s: opció '-W %s' no permet un argument
fa: %s: گزینه‌ی «-W %s» آرگومان نمی‌پذیرد
